pydata-book-2nd-edition</br>
ch05 해볼 것</br>
</br>
numpy - 배열 사용 위함</br>
</br>
데이터프레임</br>
- 관계형 DB 테이블과 유사한 기능 위해 만들어진 기능, 구조</br>
- 파이썬 신택스 이용, 인메모리</br>
</br>

In [5]:
import pandas as pd

pd.Series([7, 3, 5, 8])

0    7
1    3
2    5
3    8
dtype: int64

In [3]:
x = pd.Series([7, 3, 5, 8], index = ['서울', '대전', '대구', '부산'])
print(x)
print(x['서울'])
print(x[1])

서울    7
대전    3
대구    5
부산    8
dtype: int64
7
3

In [23]:
import pandas as pd

x = pd.Series([i for i in range(10, 20, 2)], index = ['서울', '부산', '광주', '대전', '대구'])
print(x)

서울    10
부산    12
광주    14
대전    16
대구    18
dtype: int64

In [24]:
x.reindex(sorted(x.index))  # 별도 저장 안하면 원본은 유지됨

광주    14
대구    18
대전    16
부산    12
서울    10
dtype: int64

In [25]:
x = pd.Series([3, 8, 5, 9], index=['서울', '대구', '부산', '광주'])
y = pd.Series([2, 4, 5, 1], index=['대구', '부산', '서울', '대전'])
x + y   # 인덱스를 기준으로 연산

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [27]:
medal = [1, 3, 2, 4, 2, 3]
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [4]:
x = pd.Series([3, 8, 5, 9], index=['서울', '대구', '부산', '광주'])
print(x[['서울', '부산']])  # 인덱스를 리스트 형태로 받아서 한번에 여러 요소 접근 가능
# 리스트 쓰지 않고 인덱스에 여러 요소 입력 시 오류 발생
print(x['서울', '대구'])

서울    3
부산    5
dtype: int64

KeyError: 'key of type tuple not found and not a MultiIndex'

In [6]:
print(x)
print(x[2:5])
print(x[3])
x[3] = 40
print(x)
x['부산'] = -40
print(x)
print(type(x.values))
print(x.values > 20)
print(x[x.values > 20])
print('대구' in x)  # x에 대해 in 키워드 사용 - index에 대해 조사
print(8 in x)

서울     3
대구     8
부산   -40
광주    40
dtype: int64
부산   -40
광주    40
dtype: int64
40
서울     3
대구     8
부산   -40
광주    40
dtype: int64
서울     3
대구     8
부산   -40
광주    40
dtype: int64
<class 'numpy.ndarray'>
[False False False  True]
광주    40
dtype: int64
True
False

In [92]:
x = pd.Series([11, 22, 33, 44])
x.reindex([3, 5, 1, 0], method="bfill")

3    44.0
5     NaN
1    22.0
0    11.0
dtype: float64

from IPython.display import display: display(x)로 여러 테이블 출력

In [6]:
data = {'age' : [23, 43, 12, 45], 'name' : ['민준', '현우', '서연', '동현']
, 'height' : [175.3, 180.3, 165.8, 172.7]}
x = pd.DataFrame(data, columns=['name', 'age', 'height'], index=[1, 2, 3, 4])
x

  name  age  height
1   민준   23   175.3
2   현우   43   180.3
3   서연   12   165.8
4   동현   45   172.7

In [7]:
print(x['name'])
x.name  # 시리즈로 출력

1    민준
2    현우
3    서연
4    동현
Name: name, dtype: object

1    민준
2    현우
3    서연
4    동현
Name: name, dtype: object

In [13]:
print(x.iloc[0, [1, 2]])    # 1:3 과 [1, 2] 동일
print(x.iloc[0, 1:3])
print(x.iloc[[1, 3], [1, 2]])

age          23
height    175.3
Name: 1, dtype: object
age          23
height    175.3
Name: 1, dtype: object
   age  height
2   43   180.3
4   45   172.7

In [145]:
x[x.age > 30]

  name  age  height
2   현우   43   180.3
4   동현   45   172.7

In [147]:
x

  name  age  height
1   민준   23   175.3
2   현우   43   180.3
3   서연   12   165.8
4   동현   45   172.7

In [141]:
x.mean(1)   # axis 설정 - 컬럼을 변화시키면서 구함(행 기준으로 결과 나옴)
# 숫자들에 대해서만 계산됨

1     99.15
2    111.65
3     88.90
4    108.85
dtype: float64

In [143]:
x.mean(0)    # 인덱스를 변화시키면서 구함(열 기준으로 결과 나옴)

age        30.750
height    173.525
dtype: float64

In [144]:
x.mean()

age        30.750
height    173.525
dtype: float64

In [28]:
ary = [[1, 2], [2, 3], [4, 5]]
data = pd.DataFrame(ary, columns=['First', 'Second'], index = [4, 5, 6])
data

   First  Second
4      1       2
5      2       3
6      4       5

In [127]:
data.iloc[2]

First     4
Second    5
Name: 6, dtype: int64

In [133]:
data.head(2)

   First  Second
4      1       2
5      2       3

In [132]:
data.tail(1)

   First  Second
6      4       5